#include <iostream>
using namespace std;

// Функція для очищення кінця поточного рядка
void clreol() 
{
    cout << "\r\033[K"; // Повернення курсора на початок рядка та очищення його
}
// Функція для переміщення курсора на вказану кількість позицій вліво та очищення рядка
void clreol(int count)
{
    cout << "\033[" << count << "D" << "\033[K"; // Переміщення курсора вліво та очищення рядка
}

int main() 
{
    cout << "\033[0m"; // Скидання кольору та стилю тексту
    cout << "\033[?7l"; // Вимкнення режиму автоперенесення тексту
    cout << "Function's test.";
    clreol(); // Очищення поточного рядка
    cout << "Function's second test.";
    clreol(10); // Переміщення курсора на 5 позицій вліво та очищення рядка

    return 0;
}

